Documents/ОплатаПлатежнойКартой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ОплатаПлатежнойКартой</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ЮридическоеФизическоеЛицо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЮридическоеФизическоеЛицо</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБрони</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ОплатаПлатежнойКартой/Forms/ФормаДокументаОднострочная/Ext/Form/Module.bsl
//Процедура ЗаполнитьФормуПКО(Парам)
//на основании присланной структуры параметров заполняет текущий документ
&НаСервере
Процедура ЗаполнитьФормуПКО(Парам)
	Объект.ВидОплаты=ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораКлиент"); 
	Объект.Контрагент = Парам.Контрагент;
	КолВо = Объект.РасшифровкаПлатежа.Количество();
	Строка = Объект.РасшифровкаПлатежа.НайтиПоИдентификатору(КолВо-1);
	Строка.ДоговорКонтрагента = Парам.РасшифровкаПлатежаДоговорКонтрагента;
	Строка.СпособПогашенияЗадолженности = Перечисления.СпособыПогашенияЗадолженности.Получить(0);
	Строка.СчетУчетаРасчетовСКонтрагентом = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.01");
	Строка.СчетУчетаРасчетовПоАвансам = ПланыСчетов.Хозрасчетный.НайтиПоКоду("62.02");
	Объект.ВидОплаты = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидыОперацийОплатаПлатежнойКартой");
	ТекущийЭлемент = ЭтаФорма.Элементы.СуммаДокумента;
КонецПроцедуры


//НайтиДоговорПокупателя(НомерЗаявки,ПоУмолчанию = Ложь)
//выполняет поиск договора покупателя, на основании присланного номера заявки
//новый договор не создает
//возвращает ссылку на договор
&НаСервере
Функция НайтиДоговорПокупателя(НомерЗаявки,ПоУмолчанию = Ложь)
	ВидДоговораКлиент = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораКлиент");
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование 
		|ИЗ 
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Номер = &НомерДоговора
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора 
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления						
		|"); 
	Запрос.УстановитьПараметр("НомерДоговора", НомерЗаявки);	
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговораКлиент);		
	Результат = Запрос.Выполнить().Выбрать(); 
	Пока Результат.Следующий() Цикл 		
		Возврат Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Возврат ПоУмолчанию;
КонецФункции

&НаСервере
Функция СтрФальш()
	Возврат ЭТ_ОбщийМодуль2.СтрФальш();
КонецФункции

//ВернутьКонтрагентаПоЗаявке(Заявка)
//возвращает Контрагента 1С по заявке, на основании присланной структуры параметров заявки СБ
&НаСервере
Функция ВернутьКонтрагентаПоЗаявке(Заявка)
	//Получаем заявку
	Заказчик = ЭТ_ОбщийМодуль2.User(Новый Структура("id",Заявка.client_id));
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование
		|ИЗ 
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	НЕ Контрагенты.ПометкаУдаления						
		|	И ((Контрагенты.ИНН = &ИНН И Контрагенты.ИНН<>"""")
		|		ИЛИ (ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000)) ПОДОБНО &ПаспортПолный И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000))<>"""")
		|		ИЛИ ((Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортПолный ИЛИ Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортНомер) И (Контрагенты.ДокументУдостоверяющийЛичность ПОДОБНО &ПаспортДата) И Контрагенты.ДокументУдостоверяющийЛичность<>"""")
		|		ИЛИ (Контрагенты.НаименованиеПолное ПОДОБНО &Фамилия И Контрагенты.НаименованиеПолное ПОДОБНО &Имя И Контрагенты.НаименованиеПолное ПОДОБНО &Отчество И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000)) ПОДОБНО &ДатаРождения И Контрагенты.НаименованиеПолное<>"""" И ВЫРАЗИТЬ(Контрагенты.Комментарий КАК СТРОКА(1000))<>"""")
		|	)
		|"); 
	//Если Заказчик.u_inn="" Тогда Заказчик.u_inn = СтрФальш(); КонецЕсли;
	Запрос.УстановитьПараметр("ИНН", Заказчик.u_inn);	
	//Если Заказчик.u_passport_number="" Тогда Заказчик.u_passport_number = СтрФальш(); КонецЕсли;
	
	Если СтрДлина(СокрЛП(Заказчик.u_passport_number))>0 Тогда ПаспортПолный = "%"+СокрЛП(Заказчик.u_passport_number)+"%"; Иначе ПаспортПолный=""; КонецЕсли;	
	Запрос.УстановитьПараметр("ПаспортПолный", ПаспортПолный);
	
	Если СтрДлина(СокрЛП(Заказчик.u_passport_number))>0 Тогда ПаспортНомер = "%"+СокрЛП(Заказчик.u_passport_number)+"%"; Иначе ПаспортНомер=""; КонецЕсли;	
	Запрос.УстановитьПараметр("ПаспортНомер", ПаспортНомер);
	
	
	Если СтрДлина(СокрЛП(Заказчик.u_passport_date))>0 Тогда ПаспортДата = "%"+СокрЛП(Заказчик.u_passport_date)+"%"; Иначе ПаспортДата=""; КонецЕсли;	
	Запрос.УстановитьПараметр("ПаспортДата", ПаспортДата);
	
	//Если Заказчик.u_surname="" Тогда Заказчик.u_surname = СтрФальш(); КонецЕсли;	
	Если СтрДлина(СокрЛП(Заказчик.u_surname))>0 Тогда Фамилия = "%"+СокрЛП(Заказчик.u_surname)+"%"; Иначе Фамилия=""; КонецЕсли;	
	Запрос.УстановитьПараметр("Фамилия", Фамилия);
	
	//Если Заказчик.u_surname="" Тогда Заказчик.u_surname = СтрФальш(); КонецЕсли;
	Если СтрДлина(СокрЛП(Заказчик.u_name))>0 Тогда Имя = "%"+СокрЛП(Заказчик.u_name)+"%"; Иначе Имя=""; КонецЕсли;	
	Запрос.УстановитьПараметр("Имя", Имя);
	
	//Если Заказчик.u_sname="" Тогда Заказчик.u_sname = СтрФальш(); КонецЕсли;
	Если СтрДлина(СокрЛП(Заказчик.u_sname))>0 Тогда Отчество = "%"+СокрЛП(Заказчик.u_sname)+"%"; Иначе Отчество=""; КонецЕсли;	
	Запрос.УстановитьПараметр("Отчество", Отчество);
	
	Если СтрДлина(СокрЛП(Заказчик.u_birthday))>0 Тогда ДатаРождения = ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_birthday); Иначе ДатаРождения=""; КонецЕсли;	
	Запрос.УстановитьПараметр("ДатаРождения", ДатаРождения);
	
	Результат = Запрос.Выполнить().Выбрать();
	НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка();	
	Пока Результат.Следующий() Цикл 
		НайденКонтрагент = Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Если НайденКонтрагент = Справочники.Контрагенты.ПустаяСсылка() Тогда
		НайденКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
		//Физик или Юрик
		Если СтрДлина(СокрЛП(Заказчик.u_company))>0 Тогда
			//заполняем юрика
			Если Заказчик.u_company<>СтрФальш() Тогда НайденКонтрагент.Наименование = Заказчик.u_company; КонецЕсли;
			Если Заказчик.u_company<>СтрФальш() Тогда НайденКонтрагент.НаименованиеПолное = Заказчик.u_company; КонецЕсли;
			НайденКонтрагент.ЮридическоеФизическоеЛицо =  Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;
			Если Заказчик.u_inn<>СтрФальш() Тогда НайденКонтрагент.ИНН =  Заказчик.u_inn; КонецЕсли;
		Иначе
			//заполняем физика
			НайденКонтрагент.Наименование = "";
			Если Заказчик.u_surname<>СтрФальш() И СтрДлина(СокрЛП(Заказчик.u_surname)) Тогда 
				Если СтрДлина(СокрЛП(НайденКонтрагент.Наименование))>0 Тогда НайденКонтрагент.Наименование = НайденКонтрагент.Наименование +" "; КонецЕсли;
				НайденКонтрагент.Наименование = НайденКонтрагент.Наименование + Заказчик.u_surname;
			КонецЕсли;
			Если Заказчик.u_name<>СтрФальш() И СтрДлина(СокрЛП(Заказчик.u_name)) Тогда 
				Если СтрДлина(СокрЛП(НайденКонтрагент.Наименование))>0 Тогда НайденКонтрагент.Наименование = НайденКонтрагент.Наименование +" "; КонецЕсли;
				НайденКонтрагент.Наименование = НайденКонтрагент.Наименование + Заказчик.u_name;
			КонецЕсли;
			Если Заказчик.u_sname<>СтрФальш() И СтрДлина(СокрЛП(Заказчик.u_sname)) Тогда 
				Если СтрДлина(СокрЛП(НайденКонтрагент.Наименование))>0 Тогда НайденКонтрагент.Наименование = НайденКонтрагент.Наименование +" "; КонецЕсли;
				НайденКонтрагент.Наименование = НайденКонтрагент.Наименование + Заказчик.u_sname;
			КонецЕсли;
			НайденКонтрагент.НаименованиеПолное = НайденКонтрагент.Наименование ;			
			НайденКонтрагент.ЮридическоеФизическоеЛицо =  Перечисления.ЮридическоеФизическоеЛицо.ФизическоеЛицо;
			Если Заказчик.u_inn<>СтрФальш() Тогда НайденКонтрагент.ИНН =  Заказчик.u_inn; КонецЕсли;
			Паспорт = "";
			Если СтрДлина(Заказчик.u_passport_number)>0 и Заказчик.u_passport_number<>СтрФальш() Тогда 
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;				
				Паспорт = Паспорт+Заказчик.u_passport_number;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_passport_taken)>0 и Заказчик.u_passport_taken<>СтрФальш() Тогда 
				Если СтрДлина(Паспорт)>0 Тогда Паспорт = Паспорт+" "; КонецЕсли;				
				Паспорт = Паспорт+"выдан "+Заказчик.u_passport_taken;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_passport_date)>0 и Заказчик.u_passport_date<>СтрФальш() Тогда 				
				Если СтрДлина(Паспорт)>0 и Паспорт<>СтрФальш() Тогда Паспорт = Паспорт+" "; КонецЕсли;
				Паспорт = Паспорт+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_passport_date);
			КонецЕсли;
			Если СтрДлина(Паспорт)>0 Тогда 
				НайденКонтрагент.ДокументУдостоверяющийЛичность = Паспорт;
			КонецЕсли;
			
			ДатаРождения = "";			
			Если СтрДлина(Заказчик.u_birthday)>0 и Заказчик.u_birthday<>СтрФальш() Тогда 
				ДатаРождения = ДатаРождения+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(Заказчик.u_birthday);
			КонецЕсли;
			
			НайденКонтрагент.Комментарий = "";
			Если СтрДлина(Паспорт)>0 Тогда Если СтрДлина(НайденКонтрагент.Комментарий)>0 Тогда НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" "; КонецЕсли; НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+Паспорт; КонецЕсли;
			Если СтрДлина(ДатаРождения)>0 Тогда Если СтрДлина(НайденКонтрагент.Комментарий)>0 Тогда НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" "; КонецЕсли; НайденКонтрагент.Комментарий = НайденКонтрагент.Комментарий+" д.р. "+ДатаРождения; КонецЕсли;
		КонецЕсли;
		НайденКонтрагент.ДополнительнаяИнформация = "";
		Если СтрДлина(Заказчик.address)>0  и  Заказчик.address<>СтрФальш() Тогда
			Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
			НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Адрес: "+Заказчик.address;
			НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
			НоваяСтрока.Представление = СокрЛП(Заказчик.address);				
		КонецЕсли;
		
		Если СтрДлина(Заказчик.u_phone_mobile)>0 ИЛИ СтрДлина(Заказчик.u_phone)>0 Тогда
			Телефоны = Новый Массив(2);
			СчетМассив = 0;
			Если СтрДлина(Заказчик.u_phone_mobile)>0 Тогда
				Телефоны[СчетМассив] = Заказчик.u_phone_mobile;
			КонецЕсли;
			Если СтрДлина(Заказчик.u_phone)>0 Тогда
				Телефоны[СчетМассив] = Заказчик.u_phone;
			КонецЕсли;				
			Если Телефоны.Количество()>0 Тогда
				Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
				НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Телефоны: "+СокрЛП(СтрСоединить(Телефоны,", "));					
				НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
				НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Телефон;
				НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
				НоваяСтрока.Представление = СокрЛП(СтрСоединить(Телефоны,", "));
				НоваяСтрока.НомерТелефона = Телефоны[0];
			КонецЕсли;				
		КонецЕсли;
		Если СтрДлина(Заказчик.u_email)>0 и  Заказчик.u_email<>СтрФальш() Тогда
			Если СтрДлина(НайденКонтрагент.ДополнительнаяИнформация)>0 Тогда НайденКонтрагент.ДополнительнаяИнформация = НайденКонтрагент.ДополнительнаяИнформация+" "; КонецЕсли;				
			НайденКонтрагент.ДополнительнаяИнформация =  НайденКонтрагент.ДополнительнаяИнформация+"Эл.почта: "+Заказчик.u_email;
			НоваяСтрока=НайденКонтрагент.КонтактнаяИнформация.Добавить();
			НоваяСтрока.Тип = Перечисления.ТипыКонтактнойИнформации.Адрес;
			НоваяСтрока.Вид = Перечисления.ВидыКонтактныхЛиц.ЛичныйКонтакт;
			НоваяСтрока.АдресЭП = Заказчик.u_email;
			НоваяСтрока.Представление = СокрЛП(Заказчик.u_email);			
		КонецЕсли;
		КаталогЗаказчиков = ЭТ_ОбщийМодуль2.ПолучитьНастройку("КаталогЗаказчиков");
		НайденКонтрагент.Родитель = КаталогЗаказчиков;
		НайденКонтрагент.Записать();
	КонецЕсли;
	Возврат НайденКонтрагент;
КонецФункции


//СоздатьДоговорПокупателя(Заявка)
//на основании присланной структуры параметров заявки СБ, 
//осуществляет поиск договора в 1С, если договора нет, то создается новый договор
&НаСервере
Функция СоздатьДоговорПокупателя(Заявка)
	//Получаем заявку
	
	//Заявка = ЭТ_ОбщийМодуль2.Request(Новый Структура("id",КодЗаявки));
	Заказчик = ЭТ_ОбщийМодуль2.User(Новый Структура("id",Заявка.client_id));
	Контрагент = ВернутьКонтрагентаПоЗаявке(Заявка);
	Запрос = Новый Запрос(" 
		|ВЫБРАТЬ 
		|	Ссылка, 
		|	Наименование
		|ИЗ 
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И (
		|		(ДоговорыКонтрагентов.Номер = &НомерЗаявки
		|		ИЛИ ДоговорыКонтрагентов.Наименование ПОДОБНО &НомерЗаявкиЧасть)
		|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления								
		|	)
		|"); 
	Запрос.УстановитьПараметр("Контрагент", Контрагент.Ссылка);	
	Запрос.УстановитьПараметр("НомерЗаявки", СокрЛП(Заявка.id_internal));
	Запрос.УстановитьПараметр("НомерЗаявкиЧасть", "%"+СокрЛП(Заявка.id_internal)+"%");
	Результат = Запрос.Выполнить().Выбрать();
	НайденДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	Пока Результат.Следующий() Цикл 
		НайденДоговор = Результат.Ссылка;
		Прервать;
	КонецЦикла;  
	Если НайденДоговор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка() Тогда
		НайденДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();		
		НайденДоговор.Владелец = Контрагент.Ссылка;
		НайденДоговор.Номер = СокрЛП(Заявка.id_internal);
		ДатаЗ = Заявка.dat;
		НайденДоговор.Дата = ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВДату(ДатаЗ);
		ДатаЗ = Заявка.dat;
		НайденДоговор.Наименование = СокрЛП(Заявка.id_internal)+" от "+ЭТ_ОбщийМодуль2.КонвертацияДатыИзЮниксВСтроку(ДатаЗ);
		ВидДоговора = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВидДоговораКлиент");
		НайденДоговор.Организация = ЭТ_ОбщийМодуль2.ПолучитьНастройку("Организация");
		НайденДоговор.ВалютаВзаиморасчетов = ЭТ_ОбщийМодуль2.ПолучитьНастройку("ВалютаДокументов1С");
		НайденДоговор.ВидДоговора = ВидДоговора;
		НайденДоговор.Записать();
	КонецЕсли;
	Возврат НайденДоговор.Ссылка;
КонецФункции

//ПолучитьКонтрагентаПоДоговору(Договор)
// возвращает контрагента по договору
&НаСервере
Функция ПолучитьКонтрагентаПоДоговору(Договор,Адрес="")
	Если СтрДлина(СокрЛП(Адрес))>0 Тогда 
		ЭТ_ОбщийМодуль2.КорректировкаЭлПочтыКонтрагента(Договор.Владелец,Адрес);
	КонецЕсли;
	Возврат Договор.Владелец;
КонецФункции

//ПолучитьДанныеКлиента(КодКлиента)
//по прислмнному коду клиента возвращает структуру данных клиента в СБ
&НаСервере
Функция ПолучитьДанныеКлиента(КодКлиента)
	Возврат ЭТ_ОбщийМодуль2.User(Новый Структура("id",КодКлиента));
КонецФункции

//ПолучитьДанныеЗаявки(СледЗаявкаНомер)
//по присланному коду заявки получает структуру данных заявки из СБ
&НаСервере
Функция ПолучитьДанныеЗаявки(СледЗаявкаНомер)
	Возврат ЭТ_ОбщийМодуль2.Request(Новый Структура("id",СледЗаявкаНомер));
КонецФункции

//ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
//получает настройку клиента по присланному ключу
&НаСервере
Функция ПолучитьНастройку(Ключ,ПоУмолчанию = Неопределено)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьНастройку(Ключ,ПоУмолчанию);	
КонецФункции

//ПолучитьМассивЗаявок(Параметры)
//согласно присланной структуре параметров, получает перечень подходящих заявок из СБ
&НаСервере
Функция ПолучитьМассивЗаявок(Параметры)
	Возврат ЭТ_ОбщийМодуль2.RequestSearch(Параметры);	
КонецФункции

//ЭТ_ЗаполнитьНаОснованииСБВместо(Команда)
//реакция ЗаполнитьНаОсновании
&НаКлиенте
Процедура ЭТ_ЗаполнитьНаОснованииСБВместо(Команда)
	ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = НЕ ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость;
КонецПроцедуры

//ЭТ_ЗаполнитьФорму(Парам)
//на основании присланных данных заполняет сумму документа
&НаСервере
Процедура ЭТ_ЗаполнитьФорму(Парам)
	Объект.СуммаДокумента = Парам.Парам
КонецПроцедуры

// ПолучитьВариантыНомера(СтрокаПоиска)
//на основании присланной строки с номером документа возвращает варианты возможных номеров заявки
&НаСервере
Функция ПолучитьВариантыНомера(СтрокаПоиска)
	Возврат ЭТ_ОбщийМодуль2.ПолучитьВариантыНомера(СтрокаПоиска);
КонецФункции

Функция ПолучитьИННОрганизации(Организация)
	Возврат Организация.ИНН;
КонецФункции

//ЭТ_ЗаполнитьСБВместо(Команда)
//реакция на нажатие кнопки Заполнить на панели заполнения из СБ
//поиск клиента, поиск договора, заполнение формы
&НаКлиенте
Процедура ЭТ_ЗаполнитьСБВместо(Команда)
	Объект.Организация = ПолучитьНастройку("Организация");
	ТекущийПрефикс = ПолучитьНастройку("Префикс");
	МассивНомеров = Новый Массив;
	РасшифровкаПлатежаСтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	Для Каждого ВариантНомера Из ПолучитьВариантыНомера(ЭтаФорма.СтрокаПоиска) Цикл
		Парам = Новый Структура;
		Парам.Вставить("r_id_internal",ВариантНомера);	
		МассивДанных = ПолучитьМассивЗаявок(Парам);
		Если МассивДанных.Количество()>0 Тогда		
			Для Каждого СледЭлемент Из МассивДанных Цикл
				МассивНомеров.Добавить(СледЭлемент.id);
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
	Для Каждого СледЗаявкаНомер Из ЭТ_ОбщийМодуль2.УдалитьДублиИзМассива(МассивНомеров) Цикл
		ДанныеЗаявки = 	ПолучитьДанныеЗаявки(СледЗаявкаНомер);
		Если ДанныеЗаявки.Количество()>0 Тогда
			Для Каждого СледЗаявка Из ДанныеЗаявки Цикл
				//Проверяем наличие договора
				Если СледЗаявка.Свойство("id_internal") Тогда
					НайденДоговор = НайтиДоговорПокупателя(СледЗаявка.id_internal,Ложь);
					Если НЕ НайденДоговор = Ложь Тогда
						Контрагент = ПолучитьКонтрагентаПоДоговору(НайденДоговор,СледЗаявка.client_email);
						РасшифровкаПлатежаДоговорКонтрагента=НайденДоговор;
					Иначе
						СозданДоговор = СоздатьДоговорПокупателя(СледЗаявка);
						Контрагент = ПолучитьКонтрагентаПоДоговору(СозданДоговор,СледЗаявка.client_email);
						//Сообщить(Контрагент);
						РасшифровкаПлатежаДоговорКонтрагента=СозданДоговор;
					КонецЕсли;     
					Если СледЗаявка.supplier_inn = ПолучитьИННОрганизации(Объект.Организация) Тогда
						ОтражениеАванса = ПолучитьНастройку("ОтражениеАвансаПоставщики","Доход УСН"); //"Доход УСН";             
						Сообщить("Наша компания является туроператором");
						//ПоказатьПредупреждение(,"Наша компания является туроператором",,"Предупреждение");
					Иначе
						ОтражениеАванса = ПолучитьНастройку("ОтражениеАвансаАгенты","Доход комитента"); //"Доход комитента";
					КонецЕсли;
					ЗаполнитьФормуПКО(Новый Структура("Контрагент, РасшифровкаПлатежаДоговорКонтрагента",Контрагент, РасшифровкаПлатежаДоговорКонтрагента));
					РасшифровкаПлатежаОтражениеАвансаПредставление = ОтражениеАванса;
				КонецЕсли;
				ЭтаФорма.РасшифровкаПлатежаСпособПогашенияЗадолженности = ПредопределенноеЗначение("Перечисление.СпособыПогашенияЗадолженности.Автоматически");
			КонецЦикла;
		КонецЕсли;		
	КонецЦикла;
	ВидОплатыПриИзмененииНаСервере();
	ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = Ложь;
КонецПроцедуры

//ЭТ_ОткрытьПоискСБВместо(Команда)
//управвление видимостью панели заполнения на соновании СБ
&НаКлиенте
Процедура ЭТ_ОткрытьПоискСБВместо(Команда)
	ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость = НЕ ЭтаФорма.Элементы.ПанельПоискаСБ.Видимость;
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлПочтуКонтрагента()
	//вынесено в  чечать ч
	//ТекущийПрефикс = ПолучитьНастройку("Префикс");
	//МассивНомеров = Новый Массив;
	//Для Каждого СледСтрока Из Объект.РасшифровкаПлатежа Цикл
	//	Для Каждого ВариантНомера Из ПолучитьВариантыНомера(СледСтрока.ДоговорКонтрагента.Номер) Цикл
	//		Парам = Новый Структура;
	//		Парам.Вставить("r_id_internal",ВариантНомера);	
	//		МассивДанных = ПолучитьМассивЗаявок(Парам);
	//		Если МассивДанных.Количество()>0 Тогда		
	//			Для Каждого СледЭлемент Из МассивДанных Цикл
	//				МассивНомеров.Добавить(СледЭлемент.id);
	//			КонецЦикла;
	//		КонецЕсли;		
	//	КонецЦикла;
	//КонецЦикла;
	//Для Каждого СледЗаявкаНомер Из ЭТ_ОбщийМодуль2.УдалитьДублиИзМассива(МассивНомеров) Цикл
	//	ДанныеЗаявки = 	ПолучитьДанныеЗаявки(СледЗаявкаНомер);
	//	Если ДанныеЗаявки.Количество()>0 Тогда
	//		Для Каждого СледЗаявка Из ДанныеЗаявки Цикл
	//			//Проверяем наличие договора
	//			Если СледЗаявка.Свойство("id_internal") Тогда
	//				НайденДоговор = НайтиДоговорПокупателя(СледЗаявка.id_internal,Ложь);
	//				Если НЕ НайденДоговор = Ложь Тогда
	//					Контрагент = ПолучитьКонтрагентаПоДоговору(НайденДоговор,СледЗаявка.client_email);
	//					РасшифровкаПлатежаДоговорКонтрагента=НайденДоговор;
	//				Иначе
	//					СозданДоговор = СоздатьДоговорПокупателя(СледЗаявка);
	//					Контрагент = ПолучитьКонтрагентаПоДоговору(СозданДоговор,СледЗаявка.client_email);
	//				КонецЕсли;
	//			КонецЕсли;
	//		КонецЦикла;
	//	КонецЕсли;		
	//КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ЭТ_РасшифровкаПлатежаДоговорКонтрагентаПриИзмененииПосле(Элемент)
	//ЭТ_РасшифровкаПлатежаДоговорКонтрагентаПриИзмененииПослеНаСервере();
	ОбновитьЭлПочтуКонтрагента();
КонецПроцедуры

&НаКлиенте
Процедура ЭТ_КонтрагентПриИзмененииПосле(Элемент)
	ОбновитьЭлПочтуКонтрагента();
КонецПроцедуры

&НаСервере
Функция ЭтоНовыйОбъект()
	Возврат Объект.Ссылка.Пустая();
КонецФункции

&НаКлиенте
Процедура ЭТ_ПриОткрытииПосле(Отказ)
	Если ЭтоНовыйОбъект() Тогда
		УстановитьбезДоходКомитента();
		РасшифровкаПлатежаОтражениеАвансаПредставлениеПриИзменении(ЭтаФорма.Элементы.РасшифровкаПлатежаОтражениеАвансаПредставление);
		УстановитьбезНДС();
		//РасшифровкаПлатежаСтавкаНДСПриИзменении(ЭтаФорма.Элементы.РасшифровкаПлатежаСтавкаНДС);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура УстановитьбезНДС()
	ЭтотОбъект.РасшифровкаПлатежаСтавкаНДС = Перечисления.СтавкиНДС["БезНДС"];
КонецПроцедуры
	
&НаСервере
Процедура УстановитьбезДоходКомитента()
	ЭтотОбъект.РасшифровкаПлатежаОтражениеАвансаПредставление = Перечисления.ПорядокОтраженияАвансов["ДоходКомитента"];
КонецПроцедуры
	

&НаКлиенте
Процедура ЭТ_КомандаРеестрПлатежейПосле(Команда)
	 ОткрытьФорму("Обработка.ЭТ_РеестрПлатежей.Форма",,,,,,,РежимОткрытияОкнаФормы.Независимый);
КонецПроцедуры
